import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class ShabaService {

  constructor() { }
  s = [
    {
      name: 'أبو بَكر الصّدِّيق',
      info: 'هو أولُ الخُلفاء الراشدين، وأول من أسلم من الرجال، وهو وزيرُ نبيّ الإسلام مُحمد وصاحبهُ، ورفيقهُ عند هجرته إلى المدينة المنورة. بويع أبو بكر بالخِلافة، فبدأ بإدارة شؤون الدولة الإسلامية من تعيين الولاة والقضاء وتسيير الجيوش، وارتدت كثير من القبائل العربية عن الإسلام، فأخذ يقاتلها ويُرسل الجيوش لمحاربتها حتى أخضع الجزيرة العربية بأكملها تحت الحُكم الإسلامي، ولما انتهت حروب الرِّدة، بدأ أبو بكر بتوجيه الجيوش الإسلامية لفتح العراق وبلاد الشَّام، ففتح مُعظم العراق وجزءاً كبيراً من أرض الشَّام.'
    },

    {
      name: `عمر بن الخطاب`,
      info: `وهو أحد العشرة المبشّرين بالجنّة؛ فقد أسلم عمر بن الخطاب حين سمع خباب بن الأرت وهو يعلّم القرآن الكريم لأخته فاطمة وزوجها، وحينما سمع القرآن طلب أن يرى النبيّ عليه السلام، وأسلم بين يديه في السنة السادسه من البعثة.
    عرف بزهده وقوّته في إظهار الحقّ ودفاعه عن الإسلام .
    قويٌّ لا يخاف أحداً.
    يعتبر عمر بن الخطاب أوّل من قام بجمع الناس في شهر رمضان ليقوّموه.
    يعدّ عمر بن الخطّاب أوّل خليفة يقوم بتفقّد رعيّته ليلاً وهم نيام، ويعطي لكلّ بيتٍ ما ينقصه.
    قام عمر بن الخطاب بتدوين الدواوين واستقضى القضاة، وقام بجعل الأعطية فريضة، وقام بالحج في الناس كافّةٍ رجالاً ونساءً.
    كان عمر متواضعاً، ولقد تمّ استشهاده عند خروجه من المسجد بعد صلاة الفجر على يد أبو لؤلؤة المجوسي حين قام بطعنه عدّة طعنات، وقد تمّ دفنه في الحجرة النبويّة الموجودة في المسجد النبوي بجانب الرسول وأبو بكر الصدّيق.`
    },

    {
      name: `عثمان بن عفان`,
      info: `أسلم عثمان بن عفان بعد البعثة على يد أبو بكر الصدّيق، وهو أحد المبشّرين بالجنّة.
    أسلم عثمان بن عفان بعد البعثة.
    يعدّ عثمان بن عفان أوّل من قام بالهجرة إلى الحبشة، وأوّل من قام بختم القرآن في ركعة واحدة، وأوّل من قام بإنشاء المسجد .`
    },
    {
      name: `علي بن أبي طالب`,
      info: `هو ابن عمّ الرّسول محمد عليه السلام، ولد قبل البعثة، ويعدّ من أوائل من آمنوا مع الرسول من الصبيان.
    شارك الرسول في جميع غزواته .
    عرف علي بن أبي طالب بزهده وتواضعه وحبّه للرسول وتضحيته من أجله وبكرمه وصداقته.
    يع بالخلافة سنة 35 هـ (656 م) بالمدينة المنورة، وحكم خمس سنوات وثلاث أشهر، ووقعت الكثير من المعارك بسبب الفتن التي تعد امتدادا لفتنة مقتل عثمان، أولها موقعة الجمل ثم موقعة صفين، كما خرج على علي جماعة عرفوا بالخوارج وهزمهم في النهروان، وظهرت جماعات تعاديه وتتبرأ من حكمه وسياسيته سموا بالنواصب ولعل أبرزهم الخوارج. واستشهد على يد عبد الرحمن بن ملجم في رمضان سنة 40 هـ 661 م.`
    },
    {
      name: `الزّبير بن العوّام`,
      info: `ابن عمة نبي الإسلام محمد بن عبد الله، وأحد الثمانية السابقين إلى الإسلام، يُلقب بـ حواري رسول الله؛ لأن النبي قال عنه: «إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًا، وَحَوَارِيَّ الزُّبَيْرُ»، أوَّل من سلَّ سيفه في الإسلام، وهو أبو عبد الله بن الزبير الذي بُويع بالخلافة ولكن خلافته لم تمكث طويلًا، وزوج أسماء بنت أبي بكر المُلقّبة بذات النطاقين. شارك في جميع الغزوات في العصر النبوي، وشارك في فتح مصر، وجعله عمر بن الخطاب في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، وبعد مقتل عثمان بن عفان خرج إلى البصرة مطالبًا بالقصاص من قتلة عثمان فقَتَله عمرو بن جرموز في موقعة الجمل`
    },
    {
      name: `طَلْحَة بن عُبَيْد اللّه  `,
      info: `هو أحد الثمانية السابقين الأولين إلى الإسلام، قال عنه الرسول محمد أنه شهيد يمشي على الأرض فقال: «من سره أن ينظر إلى شهيد يمشي على وجه الأرض فلينظر إلى طلحة بن عبيد الله». شارك في جميع الغزوات في العصر النبوي إلا غزوة بدر حيث كان بالشام، وكان ممن دافعوا عن الرسول محمد في غزوة أحد حتى شُلَّت يده، فظل كذلك إلى أن مات. وجعله عمر بن الخطاب في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، وبعد مقتل عثمان بن عفان خرج إلى البصرة مطالبًا بالقصاص من قتلة عثمان فقُتِلَ في موقعة الجمل.`
    },
    {
      name: `عبد الرّحمن بن عوف  `,
      info: `هو أحد الثمانية الذين سبقوا بالإسلام، كان اسمه في الجاهلية عبد عمرو، وقيل عبد الكعبة، فسماه النبي عبد الرحمن. شارك في جميع الغزوات في العصر النبوي، وأرسله النبي على سرية إلى دومة الجندل، وصلى النبي محمد وراءه في إحدى الغزوات، وكان عمر بن الخطاب يستشيره، وجعله عمر في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، وكان عبد الرحمن تاجرًا ثريًا وكريمًا.`
    },
    {
      name: `سَعِيد بن زَيْد`,
      info: `أحد السابقين الأولين إلى الإسلام، حيث أسلم بعد ثلاثة عشر رجلًا، كان أبوه زيد من الأحناف في الجاهلية؛ فلا يعبد إلا الله ولا يسجد للأصنام، وهو ابن عم عمر بن الخطاب، وأخته عاتكة بنت زيد زوجة عمر، وزوجته هي أخت عمر فاطمة بنت الخطاب والتي كانت سببًا في إسلام عمر بن الخطاب. شهد سعيد المشاهد كلها مع النبي إلا غزوة بدر، شهد معركة اليرموك، وحصار دمشق وفتحها، وولاه عليها أبو عبيدة بن الجراح، فكان أول من عمل نيابة دمشق من المسلمين.`
    },
    {
      name: `سَعْد بن أَبي وقاص`,
      info: `أحد الثمانية السابقين الأولين إلى الإسلام، وهو أوّل من رمى بسهمٍ في سبيل الله، وقال له النبي: «ارم فداك أبي وأمي»، وهو من أخوال النبي، شهد المشاهد كلها مع النبي، وكان من الرماة الماهرين، استعمله عمر بن الخطاب على الجيوش التي سَيَّرها لقتال الفرس، وفانتصر عليهم في معركة القادسية، وأَرسل جيشًا لقتال الفرس بجلولاء فهزموهم، وهو الذي فتح مدائن كسرى بالعراق. فكان من قادة الفتح الإسلامي لفارس، وكان أول ولاة الكوفة، حيث قام بإنشائها بأمر من عمر سنة 17 هـ، وجعله عمر بن الخطاب في الستة أصحاب الشورى الذين ذكرهم للخلافة بعده، اعتزل سعد الفتنة بين علي ومعاوية، وكان آخر المهاجرين وفاةً.`
    },
    {
      name: `أبو عبيدة بن الجرّاح`,
      info: `أحد الثمانية السابقين الأولين إلى الإسلام، لقَّبَهُ النّبيُّ محمدٌ بأمين الأمة حيث قال: «إن لكل أمّة أميناً، وإن أميننا أيتها الأمة: أبو عبيدة بن الجراح». شهد مع الرسول محمد غزوة بدر والمشاهد كلها، وكان أبو عبيدة أحد القادة الأربعة الذين عيَّنهم أبو بكر لفتح بلاد الشام، ولما ولي عمر بن الخطاب الخلافةَ عَزَلَ خالداً بنَ الوليد، واستعمل أبا عبيدة، وقد نجح أبو عبيدة في فتح دمشق وغيرِها من مُدُنِ الشامِ وقُراها. وفي عام 18هـ الموافق 639م توفي أبو عبيدة بسبب طاعون عمواس في غور الأردن ودُفن فيه.`
    },
    {
      name: `حنظلة بن أبي عامر`,
      info: `صحابي، من الأنصار من بني ضبيعة من الأوس، أسلم، وخرج إلى غزوة أحد بعد أن سمع النفير وهو جُنُب، فقُتل يومها، قتله شداد بن الأسود الليثي وأبو سفيان بن حرب اشتركا فيه. وقال النبي محمد أن الملائكة غسّلته، فسُمّي غِسِّيل الملائكة`
    },
    {
      name: `زيد بن حارثة`,
      info: `صحابي وقائد عسكري مسلم، كان مولى للنبي محمد، وكان النبي محمد قد تبناه قبل بعثته، وهو أول الموالي إسلامًا، ومن السابقين الأولين للإسلام، والوحيد من بين أصحاب النبي محمد الذي ذُكر اسمه في القرآن. شهد زيد العديد من غزوات النبي محمد، كما بعثه قائدًا على عدد من السرايا. قُتل زيد في غزوة مؤتة وهو قائد جيش المسلمين أمام جيش من البيزنطيين والغساسنة يفوق المسلمين عددًا`
    },
    {
      name: `خالد بن الوليد`,
      info: `	صحابي، وقائد عسكري مسلم، لقّبه النبي محمد بسيف الله المسلول. اشتهر بحسن تخطيطه العسكري وبراعته في قيادة جيوش المسلمين في حروب الردة وفتح العراق والشام، وهو أحد قادة الجيوش القلائل في التاريخ الذين لم يهزموا في معركة طوال حياتهم. شارك خالد ضد المسلمين في غزوة أحد والخندق، وأسلم بعد صلح الحديبية، وشهد غزوة مؤتة، وأنقذ جيش المسلمين يومها، كما شهد فتح مكة. عزله عمر بن الخطاب من قيادة الجيوش لأنه خاف أن يفتتن الناس به، وتوفي في حمص سنة 21 هـ`
    },
    {
      name: `عمرو بن العاص`,
      info: `عمرو بن العاص السهمي القرشي الكناني، صحابي وقائد عسكري مسلم، وأحد القادة الأربعة في الفتح الإسلامي للشام، وقائد الفتح الإسلامي لمصر، وأول والٍ مسلم على مصر بعد فتحها. كان عمرو من سادة قريش في الجاهلية، فأبوه هو العاص بن وائل السهمي، وكان يحترف التجارة، فقد كان يسافر بتجارته إلى الشام واليمن ومصر والحبشة.`
    },
    {
      name: `أبو هريرة`,
      info: `صحابي محدث وفقيه وحافظ أسلم سنة 7 هـ، ولزم النبي محمد، وحفظ الحديث عنه، حتى أصبح أكثر الصحابة روايةً وحفظًا للحديث النبوي. لسعة حفظ أبي هريرة، التفّ حوله العديد من الصحابة والتابعين من طلبة الحديث النبوي الذين قدّر البخاري عددهم بأنهم جاوزوا الثمانمائة ممن رووا عن أبي هريرة. كما يعد أبو هريرة واحدًا من أعلام قُرّاء الحجاز، حيث تلقّى القرآن عن النبي محمد، وعرضه على أبي بن كعب، وأخذ عنه عبد الرحمن بن هرمز. تولى أبو هريرة ولاية البحرين في عهد الخليفة عمر بن الخطاب، كمل تولى إمارة المدينة من سنة 40 هـ حتى سنة 41 هـ. وبعدها لزم المدينة المنورة يُعلّم الناس الحديث النبوي، ويُفتيهم في أمور دينهم، حتى وفاته سنة 57 هـ.`
    },
    {
      name: `أبو ذر الغفاري `,
      info: `	صحابي من السابقين إلى الإسلام، قيل رابع أو خامس من دخل في الإسلام، وأحد الذين جهروا بالإسلام في مكة قبل الهجرة النبوية. قال عنه الذهبي في ترجمته له في كتابه «سير أعلام النبلاء»: «كان رأسًا في الزُهد، والصدق، والعلم والعمل، قوّالاً بالحق، لا تأخذه في الله لومة لائم، على حِدّةٍ فيه».`
    },
    {
      name: `	حمزة بن عبد المطلب`,
      info: `صحابي، عم النبي محمد وأخوه من الرضاعة، شهد في الجاهلية حرب الفجار، وأسلم في السنة الثانية من بعثة النبي محمد، وشهد غزوة بدر، وقُتل يوم أحد`
    },
    {
      name: `جعفر بن ابي طالب `,
      info: `صحابي وابن عم النبي محمد، من السابقين الأولين إلى الإسلام، وأخو علي بن أبي طالب. هاجر إلى الحبشة، وعاد منها يوم فتح خيبر، وقُتل في غزوة مؤتة، وهو يومها قائد المسلمين`
    },
    {
     name: `ورقة بن نوفل`,
     info: `مختلف في إسلامه، وهو ابن عم خديجة بنت خويلد. كان يقرأ التوراة والإنجيل، وقيل كان حنيفا موحدا، وقيل يهوديًا، وقيل نصرانيًا في الجاهلية، وهو الذي بشّر خديجة والنبي محمد أن الذي جاءه في الغار هو الناموس الذي أنزله الله على موسى. توفي ورقة بعد فترة وجيزة من تلك الحادثة في فترة الستة أشهر التي انقطع فيها الوحي عن النبي محمد بعد تلك الحادثة.`
    },
    {
      name: `الأرقم بن أبي الأرقم`,
      info: `صحابي من السابقين إلى الإسلام، اتخذ النبي محمد من دار الأرقم مقرًا للدعوة بداية الدعوة إلى الإسلام. وقد هاجر الأرقم إلى يثرب، وشارك مع النبي محمد في غزواته كلها. توفي الأرقم بالمدينة المنورة في خلافة معاوية بن أبي سفيان، وقد جاوز عمره الثمانين`
    },
    {
      name: `البراء بن مالك`,
      info: `صحابي، شهد عدد من غزوات النبي محمد وفتوح العراق وفارس، وقتل في فتح تستر، وهو أخو الصحابي أنس بن مالك`
    },

    {
      name: `الطفيل بن عمرو الدوسي`,
      info: `صحابي من أوائل السابقين إلى إسلام وأسلم قبل الهجرة النبوية بمكة، ثم إلى المدينة بعد غزوة أحد، فشهد الخندق وفتح مكة، وأقام فيها، وقُتل يوم اليمامة.`
    },

    {
      name: `أبو الدرداء الأنصاري`,
      info: `صحابي وفقيه وقاضي وقارئ قرآن وأحد رواة الحديث النبوي، وهو من الأنصار من بني كعب بن الخزرج بن الحارث بن الخزرج. أسلم متأخرًا يوم بدر، ودافع عن النبي يوم أحد، وشهد ما بعد ذلك من المشاهد، وكان من المجتهدين في التعبد وقراءة القرآن. رحل إلى الشام بعد فتحها ليُعلّم الناس القرآن، وليُفقّههم في دينهم، وتولى قضاء دمشق، ظل بها إلى أن مات فيها في خلافة عثمان بن عفان.`
    },

    {
      name: `أبو موسى الأشعري`,
      info: `حابي، ولاّه النبي محمد على زبيد وعدن، وولاه عمر بن الخطاب على البصرة، وولاه عثمان بن عفان على الكوفة، وكان المُحكّم الذي اختاره علي بن أبي طالب من بين حزبه يوم صفين`
    },

    {
      name: `حذيفة بن اليمان`,
      info: `صحابي من غطفان كان حليفًا للأنصار، كان أمين سر النبي محمد حيث أطلعه على أسماء المنافقين. شهد غزوة أحد وما بعدها من الغزوات، وشهد فتوح العراق وفارس، وولاه عمر المدائن، وتوفي فيها سنة 36 هـ. له رواية حديث عن النبي محمد.`
    },

    {
      name: `حسان بن ثابت`,
      info: `صحابي من الأنصار، كان من الشعراء الذي يفدون على ملوك الغساسنة في الشام قبل إسلامه، ثم أسلم وصار شاعر النبي محمد. توفي في خلافة علي بن أبي طالب.`
    },

    {
      name: `أسامة بن زيد`,
      info: `صحابي ومولى النبي محمد، أبوه زيد بن حارثة، وأمه أم أيمن حاضنة النبي محمد، بعثه النبي محمد قبل وفاته مباشرة قائدًا لجيش. سكن الشام فترة، ثم عاد فسكن المدينة المنورة، وتوفي بها سنة 54 هـ. وهو من رواة الحديث النبوي.`
    },

    {
      name: `زيد بن ثابت`,
      info: `	صحابي من الأنصار، كان من كتبة الوحي، وممن جمعوا القرآن، وهو أحد رواة الحديث النبوي، ومفتي المدينة في زمانه، وقد شهد مع النبي محمد بعض غزواته، وتوفي في خلافة معاوية`
    },
  ]
}
